In [ ]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine('postgresql://admin:admin@localhost:5433/postgres')
sales_cube = """select * from sales_cube sc where sc.store <> 'ALL';"""
with engine.connect() as conn :
    sales_cube_df = pd.read_sql(sales_cube, conn)
sales_cube_df

## Total Sales by Store All Time

In [ ]:
import matplotlib.pyplot as plt

x = sales_cube_df['store']
y = sales_cube_df['sales']
plt.xlabel('store')
plt.ylabel('sales')
plt.title("Total Sales by Store All Time")
plt.bar(x,y, color='red')

plt.show()

## Sales over Time

In [ ]:
regional_df = """select * from accounting_cube ac where ac.city <> 'ALL' and ac.year <> '1900';"""
with engine.connect() as conn :
    regional_df = pd.read_sql(regional_df, conn)
regional_df = regional_df.dropna()
regional_df = regional_df[regional_df['year'] >= 1970]
regional_df

In [ ]:
chicago = regional_df[regional_df['city'] == 'chicago'].sort_values(by='year')
tampa = regional_df[regional_df['city'] == 'tampa'].sort_values(by='year')

plt.xlabel('year')
plt.ylabel('sales')
plt.title('Sales in Tampa and Chicago since 1970')
plt.plot(chicago['year'], chicago['sales'], color='red')
plt.plot(tampa['year'], tampa['sales'], color='yellow')
plt.figure(figsize=(10,8))
plt.show()

## Sales Share by Region 2020-2023

In [51]:
regional_pie = """select * from accounting_cube ac where ac.year >= '2020' and ac.city <> 'ALL';"""
with engine.connect() as conn :
    regional_pie = pd.read_sql(regional_pie, conn)
regional_pie

       city state         quarter    year   sales
0   chicago    IL          ANNUAL  2020.0  755.40
1   chicago    IL          ANNUAL  2021.0  295.43
2   chicago    IL          ANNUAL  2022.0  443.96
3   chicago    IL          ANNUAL  2023.0  317.24
4   chicago    IL          ANNUAL  2024.0  668.04
..      ...   ...             ...     ...     ...
77    tampa    FL  second_quarter  2023.0  357.12
78    tampa    FL  second_quarter  2025.0   68.61
79    tampa    FL   third_quarter  2020.0  250.35
80    tampa    FL   third_quarter  2022.0  294.30
81    tampa    FL   third_quarter  2023.0  177.24

[82 rows x 5 columns]

In [ ]:
_